glcloud/keil_v5/ARM/PACK/.Web/NXP.MK21DA5_DFP.pdsc
    <condition id="device.MK21DA5_driver.common">
      <accept Dvendor="NXP:11" Dname="MK21DX256A???5"/>
      <accept Dvendor="NXP:11" Dname="MK21DN512A???5"/>
      <accept Dvendor="NXP:11" Dname="MK21DX128A???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MK21DA5_driver.flash">
      <accept Dvendor="NXP:11" Dname="MK21DX256A???5"/>
      <accept Dvendor="NXP:11" Dname="MK21DN512A???5"/>
      <accept Dvendor="NXP:11" Dname="MK21DX128A???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash"/>
    </condition>
    <condition id="device.MK21DA5">
      <accept Dvendor="NXP:11" Dname="MK21DX256A???5"/>
      <accept Dvendor="NXP:11" Dname="MK21DN512A???5"/>
      <accept Dvendor="NXP:11" Dname="MK21DX128A???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
    </condition>
    <condition id="devices.MK21DA5_platform.Include_core_cm4">
      <accept Dvendor="NXP:11" Dname="MK21DX256A???5"/>
      <accept Dvendor="NXP:11" Dname="MK21DN512A???5"/>
      <accept Dvendor="NXP:11" Dname="MK21DX128A???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
    </condition>
    <condition id="devices.MK21DN512Axxx5_mdk">
      <require Tcompiler="ARMCC"/>
      <accept Dvendor="NXP:11" Dname="MK21DN512A???5"/>
    </condition>
    <condition id="devices.MK21DX128Axxx5_mdk">
      <require Tcompiler="ARMCC"/>
      <accept Dvendor="NXP:11" Dname="MK21DX128A???5"/>
    </condition>
    <condition id="devices.MK21DX256Axxx5_mdk">
      <require Tcompiler="ARMCC"/>
      <accept Dvendor="NXP:11" Dname="MK21DX256A???5"/>
    </condition>
    <condition id="devices.MK21DN512Axxx5_iar">
      <require Tcompiler="IAR"/>
      <accept Dvendor="NXP:11" Dname="MK21DN512A???5"/>
    </condition>
    <condition id="devices.MK21DX128Axxx5_iar">
      <require Tcompiler="IAR"/>
      <accept Dvendor="NXP:11" Dname="MK21DX128A???5"/>
    </condition>
    <condition id="devices.MK21DX256Axxx5_iar">
      <require Tcompiler="IAR"/>
      <accept Dvendor="NXP:11" Dname="MK21DX256A???5"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="iar">
      <require Tcompiler="IAR"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="devices.MK21DA5_platform.Include_core_cm4">
      <description></description>
      <files>
        <file name="arm/startup_MK21DA5.s" category="sourceAsm" condition="mdk" attr="config"/>
        <file name="iar/startup_MK21DA5.s" category="sourceAsm" condition="iar" attr="config"/>
        <file name="MK21DA5.h" category="header" attr="config"/>
        <file name="MK21DA5_features.h" category="header" attr="config"/>
        <file name="fsl_device_registers.h" category="header" attr="config"/>
        <file name="arm/MK21DN512Axxx5_flash.scf" category="linkerScript" condition="devices.MK21DN512Axxx5_mdk" attr="config"/>
        <file name="arm/MK21DN512Axxx5_ram.scf" category="linkerScript" condition="devices.MK21DN512Axxx5_mdk" attr="config"/>
        <file name="arm/MK21DX128Axxx5_flash.scf" category="linkerScript" condition="devices.MK21DX128Axxx5_mdk" attr="config"/>
        <file name="arm/MK21DX128Axxx5_ram.scf" category="linkerScript" condition="devices.MK21DX128Axxx5_mdk" attr="config"/>
        <file name="arm/MK21DX256Axxx5_flash.scf" category="linkerScript" condition="devices.MK21DX256Axxx5_mdk" attr="config"/>
        <file name="arm/MK21DX256Axxx5_ram.scf" category="linkerScript" condition="devices.MK21DX256Axxx5_mdk" attr="config"/>
        <file name="iar/MK21DN512Axxx5_flash.icf" category="linkerScript" condition="devices.MK21DN512Axxx5_iar" attr="config"/>
        <file name="iar/MK21DN512Axxx5_ram.icf" category="linkerScript" condition="devices.MK21DN512Axxx5_iar" attr="config"/>
        <file name="iar/MK21DX128Axxx5_flash.icf" category="linkerScript" condition="devices.MK21DX128Axxx5_iar" attr="config"/>
        <file name="iar/MK21DX128Axxx5_ram.icf" category="linkerScript" condition="devices.MK21DX128Axxx5_iar" attr="config"/>
        <file name="iar/MK21DX256Axxx5_flash.icf" category="linkerScript" condition="devices.MK21DX256Axxx5_iar" attr="config"/>
        <file name="iar/MK21DX256Axxx5_ram.icf" category="linkerScript" condition="devices.MK21DX256Axxx5_iar" attr="config"/>
        <file name="system_MK21DA5.c" category="sourceC" attr="config"/>
        <file name="system_MK21DA5.h" category="header" attr="config"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Cversion="1.0.0" Csub="project_template" Cvariant="MK21DA5" isDefaultVariant="1" condition="devices.MK21DA5_device.MK21DA5_device.MK21DA5_startup_device.device_device_driver.clock_driver.common_driver.gpio_driver.port_driver.smc_driver.uart_utility.debug_console">
      <description></description>
      <files>
        <file name="project_template/board.c" category="sourceC" attr="config"/>
        <file name="project_template/board.h" category="header" attr="config"/>
        <file name="project_template/clock_config.c" category="sourceC" attr="config"/>
        <file name="project_template/clock_config.h" category="header" attr="config"/>
        <file name="project_template/peripherals.c" category="sourceC" attr="config"/>
        <file name="project_template/peripherals.h" category="header" attr="config"/>
        <file name="project_template/pin_mux.c" category="sourceC" attr="config"/>
        <file name="project_template/pin_mux.h" category="header" attr="config"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Cversion="2.0.0" Csub="dspi_cmsis" condition="RTE_Device_platform.CMSIS_Driver_Include.SPI_CMSISInclude_device.MK21DA5_driver.dspi">
      <description>DSPI CMSIS Driver</description>
      <files>
        <file name="cmsis_drivers/fsl_dspi_cmsis.c" category="sourceC"/>
        <file name="cmsis_drivers/fsl_dspi_cmsis.h" category="header"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Cversion="2.0.1" Csub="i2c_cmsis" condition="RTE_Device_platform.CMSIS_Driver_Include.I2C_CMSISInclude_device.MK21DA5_driver.i2c">
      <description>I2C CMSIS Driver</description>
      <files>
        <file name="cmsis_drivers/fsl_i2c_cmsis.c" category="sourceC"/>
        <file name="cmsis_drivers/fsl_i2c_cmsis.h" category="header"/>
      </files>
    </component>
